In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
rk =[1,2,3,4,5,6,7,8,9,10,11,13,15,12,16,17,18,20]
rk =pd.DataFrame(rk)

In [5]:
rk.head()

   0
0  1
1  2
2  3
3  4
4  5

In [21]:
sk =["abc", 13,14,"Kennedy",15,16,"Kiran",17,18,"High",19,20,"ravi"]
pd.DataFrame(sk)

          0
0       abc
1        13
2        14
3   Kennedy
4        15
5        16
6     Kiran
7        17
8        18
9      High
10       19
11       20
12     ravi

In [29]:
 l=[1,5,8,9,45,69,86,78]
siri =pd.Series(l)

In [30]:
type(siri)

pandas.core.series.Series

In [31]:
siri

0     1
1     5
2     8
3     9
4    45
5    69
6    86
7    78
dtype: int64

# Data Frame

In [32]:
data =[[1000,"ravi",6.1],
       [2000,"kesh",6.2],
       [3000,"kumar",6.5],
       [4000,"Kranthi",5.5]
    
    
]

In [34]:
df=pd.DataFrame(data,columns=['id',"Name","Height"],index =[0,1,2,3])

In [35]:
type(df)

pandas.core.frame.DataFrame

In [36]:
df.head()

     id     Name  Height
0  1000     ravi     6.1
1  2000     kesh     6.2
2  3000    kumar     6.5
3  4000  Kranthi     5.5